app/controllers/api/blogs_controller.rb

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @blog = Blog.find(params[:id])