app/controllers/api/follows_controller.rb

  def create
    @follow = Follow.new(follow_params)
    @follow.follower_id = current_user.id
    if @follow.save
---
INSERT INTO "follows" ("followee_id", "follower_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["followee_id", 2], ["follower_id", 1], ["created_at", "2015-08-12 00:09:16.440741"], ["updated_at", "2015-08-12 00:09:16.440741"]]

  def show
    @follow = Follow.find(params[:id]);
---
SELECT  "follows".* FROM "follows" WHERE "follows"."id" = $1 LIMIT 1  [["id", 11]]

  def destroy
   @follow = Follow.find(params[:id])
   @follow.follower_id = current_user.id
   @follow.destroy if @follow
---
SELECT  "follows".* FROM "follows" WHERE "follows"."id" = $1 LIMIT 1  [["id", 11]]
DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 11]]