app/controllers/api/likes_controller.rb

  def create
    @like = Like.new(like_params)
    @like.user_id = current_user.id
    if @like.save
---
INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 2], ["user_id", 1], ["created_at", "2015-08-12 04:25:02.276581"], ["updated_at", "2015-08-12 04:25:02.276581"]]

  def destroy
   @like = Like.find(params[:id])
   @like.user_id = current_user.id
   @like.destroy if @like
---
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]