app/controllers/api/posts_controller.rb

  def index
    if params[:trending].present?
      @posts = Post.preload(:tags, :likes, :user, :taggings, :notes).joins(:notes).group(:id).order(count: :desc).limit(5).page(params[:page]).per(5)
      @bool = false
    elsif params[:tag].present?
      @tagpost = true
      @posts = Post.includes(:taggings, :tags, :user).references(:tags).where(tags: {label: params[:tag]})
    elsif params[:id].present?

      @posts = Blog.find(params[:id]).posts.page(params[:page]).per(3)
---
SELECT "likes"."id" FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2  [["user_id", 1], ["post_id", 1]]