app/controllers/api/posts_controller.rb

SELECT "blogs"."id" FROM "blogs" WHERE "blogs"."user_id" = $1  [["user_id", 1]]
INSERT INTO "posts" ("title", "body", "user_id", "blog_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "asdasd"], ["body", "sdsaasdafdf"], ["user_id", 1], ["blog_id", 1], ["created_at", "2015-08-12 20:56:18.955153"], ["updated_at", "2015-08-12 20:56:18.955153"]]
---
  def create
    blog_id = User.find_blog_by_user(current_user.id)[0].id
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    @post.blog_id = blog_id
    if @post.save