app/views/api/newsfeeds/_post.json.jbuilder


json.followState current_user.followers.include?(post.user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]