app/views/api/posts/_post.json.jbuilder


like_id = post.likes.select { |like| like.user_id == current_user.id }[0]
---
SELECT "likes"."id" FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2  [["user_id", 1], ["post_id", 1]]